In [1]:
import sqlite3
import pandas as pd
db=sqlite3.connect('Schools.sqlite')

In [8]:
data=pd.read_sql_query('Select * from STUDENT', db)
data

   RollNumber    Name  Age
0         113  Mohiit   24
1         101    Aman   20
2         101    Aman   20
3         104  Nikhil   34

## Advantages for using Pandas.
#### 1. No use of CURSOR.
#### 2. No need of inbuilt function like - fetchall,fetchmany,etc.

In [9]:
data['Age']==20

0    False
1     True
2     True
3    False
Name: Age, dtype: bool

In [12]:
data[data['Age']==20]

   RollNumber  Name  Age
1         101  Aman   20
2         101  Aman   20

# Creating table using dataframe
1. create dataframe.
2. convert datafram into table.

In [16]:
#CREATING DATAFRAME

import pandas as pd
data = pd.DataFrame([[201,"Aakash","English",20000],[202,"Komal","Maths",22000],[203,"Shafi","Science",23000]],
                                 columns=['ID','Name','Course','Salary'])
data

    ID    Name   Course  Salary
0  201  Aakash  English   20000
1  202   Komal    Maths   22000
2  203   Shafi  Science   23000

In [18]:
#CONVERTING DATAFRAME TO TABLE(SQL)

data.to_sql("Faculty",db)  #(New_TableName, Database connection object)

In [20]:
data=pd.read_sql_query('Select * from STUDENT', db)
data

   RollNumber    Name  Age
0         113  Mohiit   24
1         101    Aman   20
2         101    Aman   20
3         104  Nikhil   34

In [21]:
#To add new row
data=pd.read_sql_query('Select * from STUDENT', db)
data['Address']='Test'
data

   RollNumber    Name  Age Address
0         113  Mohiit   24    Test
1         101    Aman   20    Test
2         101    Aman   20    Test
3         104  Nikhil   34    Test

In [22]:
#To add this row into database/SQL
data=pd.read_sql_query('Select * from STUDENT', db)
data['Address']='Test'
data.to_sql('STUDENT',db, if_exists = 'replace')